### [DataFrame의 인덱스 다루기 - 3]
- 행 인덱스를 정수형 인덱스로 초기화
- 기존의 행 인덱스 ==> 칼럼으로 추가 시킴[기본 값]
- 메서드 : 변수명.set_index()

In [1]:
# [1] 모듈 호출
import pandas as pd

In [2]:
# [2] Data 준비
jumsu = {"name" : ["마징가", "태권V", "원더우먼"],
         "kor" : [89, 80, 78],
         "eng" : [75, 75, 76],
         "math" : [78, 80, 82]}

In [3]:
# [3] Dict ==> DataFrame 형태로 변환
jumsuDF = pd.DataFrame(jumsu)
jumsuDF

   name  kor  eng  math
0   마징가   89   75    78
1   태권V   80   75    80
2  원더우먼   78   76    82

In [9]:
# [4] 행 인덱스 초기화 
DF2 = jumsuDF.reset_index()
DF2

   index  name  kor  eng  math
0      0   마징가   89   75    78
1      1   태권V   80   75    80
2      2  원더우먼   78   76    82

In [7]:
# [5] 행 인덱스 초기화 (기존 인덱스의 행을 칼럼으로 추가하지 않는 ~ ) 
DF2 = jumsuDF.reset_index(drop = True) # drop = True는 기존의 인덱스를 열 인덱스로 주는 것을 막음
DF2

# drop = True를 하지 않을 시
# index 칼럼을 직접 삭제하는 방법
# print(DF2.drop("index", axis = 1))
# print(DF2.drop(columns = 'index'))

   name  kor  eng  math
0   마징가   89   75    78
1   태권V   80   75    80
2  원더우먼   78   76    82